// 假设你正在爬楼梯。需要 n 阶你才能到达楼顶。

// 每次你可以爬 1 或 2 个台阶。你有多少种不同的方法可以爬到楼顶呢？
// 输入：n = 3
// 输出：3
// 解释：有三种方法可以爬到楼顶。
// 1. 1 阶 + 1 阶 + 1 阶
// 2. 1 阶 + 2 阶
// 3. 2 阶 + 1 阶

// 动态规划：f(x) = f(x - 1) + f(x - 2)
// f(1) = 0 + 1
// f(2) = f(1) + f(0) = 1 + 1
// f(3) = f(2) + f(1) = 2 + 1
// f(4) = f(3) + f(2) = 3 + 2
// f(5) = f(4) + f(3) = 5 + 3

var climbStairs = function(n) {
    let p = 0, q = 0, r = 1;
    for (let i = 1; i <= n; ++i) {
        p = q;
        q = r;
        r = p + q;
    }
    return r;
};